/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "لا يمكن إكمال الإجراء";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "حاول مرة أخرى في وقت لاحق.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "تنسيق هذه الوسائط غير مدعوم.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "قد تكون هذه الوسائط تالفة.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "هذا التطبيق غير مخول له بتشغيل هذا الملف."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "لا يمكن استخدام هذه الوسائط.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "لا يمكن فك الترميز";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "أداة فك الترميز المطلوبة لهذه الوسائط مشغولة.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "قم بإيقاف أي إجراء آخر يقوم بفك ترميز الوسائط ثم حاول مرة أخرى.";
